Revit 2026 API

# IFCFileFormat Enumeration

---

The IFC file format.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum IFCFileFormat
```
```vb
Public Enumeration IFCFileFormat
```
```cpp
public enum class IFCFileFormat
```
```fsharp
type IFCFileFormat
```

| Member name | Value | Description |
| --- | --- | --- |
| Ifc | 0 | IFC format. |
| IfcXML | 1 | IFC-XML format. |
| IfcXMLZIP | 3 | IFC-XML file, zipped to IFC-ZIP format. |
| IfcZIP | 2 | IFC file, zipped to IFC-ZIP format. |

#### Reference

Autodesk.Revit.DB.IFC Namespace